snlkuharlocal/src/InformationRegisters/ЗаданиеНаСменуСтатусовНакладной/ЗаданиеНаСменуСтатусовНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданиеНаСменуСтатусовНакладной</name>
  <resources>
    <name>СостоянияНакладной_Тек</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </resources>
  <resources>
    <name>СостоянияНакладной_Нов</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </resources>
  <resources>
    <name>Отгружен_Тек</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </resources>
  <resources>
    <name>Отгружен_Нов</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </resources>
  <resources>
    <name>ДопПараметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропущено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвторЗадания</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторОбработки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Паллета/Паллета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Паллета</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Паллета</basedOn>
  <registerRecords>AccumulationRegister.АдресноеХранениеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиЗХ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиРасходныхМатериалов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКПаллеты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистЗагрузки</name>
    <type>
      <types>DocumentRef.ЛистЗагрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>СборнаяПаллета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SSCCКод</name>
    <comment>упаковочный для клиента Лента</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПаллетирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПаллетирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеальноеПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Паллетировщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КроссДокинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НеГабарит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеКоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегацииСгенерирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.СкладТСД</types>
      <types>ExchangePlanRef.МобильныеТСД</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>Расформирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛистыНабора</name>
    <attributes>
      <name>ЛистНабора</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
    <attributes>
      <name>ШКЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>17</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЛистаНабора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппыТоваров</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробокВНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковкиПаллеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SSCCКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>21</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковкиКороба</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковкиПаллеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЗаданиеНаСменуСтатусовНакладной/ManagerModule.bsl
Функция СоздатьЗаданиеНаСменуСтатуса(Документ, СостоянияНакладной_Нов, ДопПараметры = Неопределено) Экспорт
	РеквизитыНовые	= МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры,		"РеквизитыНовые");
	Отгружен_Нов	= МаркировкаКС.ПолучитьЗначениеПараметра(РеквизитыНовые,	"Отгружен");
	
	МЗ = РегистрыСведений.ЗаданиеНаСменуСтатусовНакладной.СоздатьМенеджерЗаписи();
	
	МЗ.Документ 		= Документ;
	МЗ.АвторЗадания 	= ПараметрыСеанса.Пользователь;
	
	МЗ.СостоянияНакладной_Нов	= СостоянияНакладной_Нов;
	Если Отгружен_Нов <> Неопределено Тогда
		МЗ.Отгружен_Нов = Отгружен_Нов; 			
	КонецЕсли;	
	МЗ.ДатаЗаписи				= ТекущаяДата();
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		рШапки 			= ПолучитьРеквизитыШапки(Документ, "СостояниеНакладной,Отгружен,Контрагент");		
		МЗ.Получатель	= рШапки.Контрагент;		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Перемещение") Тогда
		рШапки			= ПолучитьРеквизитыШапки(Документ, "СостояниеНакладной,Отгружен,СкладПолучатель");		
		МЗ.Получатель	= рШапки.СкладПолучатель;		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	МЗ.СостоянияНакладной_Тек 	= рШапки.СостояниеНакладной;
	МЗ.Отгружен_Тек			 	= рШапки.Отгружен;
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		МЗ.ДопПараметры = Новый ХранилищеЗначения(ДопПараметры);	
	КонецЕсли;
	
	МЗ.Записать();
	
	Возврат Истина;
КонецФункции //СоздатьЗаданиеНаСменуСтатуса(Документ, НовоеСостояние) Экспорт

Функция ПолучитьНовыйСтатус(ДокОбъект) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();

	СтароеСостояние = ПолучитьРеквизитыШапки(ДокОбъект.Ссылка, "Отгружен,СостояниеНакладной");
	НовоеСостояние	= Новый Структура("Отгружен,СостояниеНакладной", ДокОбъект.Отгружен, ДокОбъект.СостояниеНакладной);
	
	//ДокОбъект.ДополнительныеСвойства.Вставить("СтароеСостояние", СтароеСостояние);
	//Если ДокОбъект.СостояниеНакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке И ДокОбъект.Отгружен = Перечисления.Отгружен.Резерв Тогда
	//	Если СтароеСостояние.Отгружен = Перечисления.Отгружен.Отгружен Тогда
	//		//Ничего - Возрат  
	//	Иначе           
	//		ДокОбъект.			
	//	КонецЕсли;									
	//ИначеЕсли СостояниеНакладной = Перечисления.СостоянияНакладной.Паллетирование Тогда
	
	Результат.Данные = НовоеСостояние;
	
	Результат.Успешно = Ложь; //Пока заглушка
	
	Возврат Результат;
КонецФункции


#Область ОбработкаНакладных
	

Функция ЗаменитьСтатусыНакладных(Знач пОбработки = Неопределено) Экспорт	
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ТипЗнч(пОбработки) = Тип("ТаблицаЗначений") Тогда
		пСтруктурой = Новый Структура;		
		Для Каждого СтрокаТП Из пОбработки Цикл
			пСтруктурой.Вставить(СтрокаТП.Имя, СтрокаТП.Значение);		
		КонецЦикла;
		пОбработки = пСтруктурой;
	КонецЕсли;        
	
	рПроверки = МаркировкаКС.МожноЗапускатьФЗ("МаркировкаС.ЗаменитьСтатусыНакладных");
	Если НЕ рПроверки.Успешно Тогда                   		
		ТекстСообщения = СтрСоединить(рПроверки.Ошибки, Символы.ПС) + ". Обработка отменена !";
		ЗаписатьВЛог("ЗаменаСтатусовНакладных", ТекстСообщения, "Ошибка");		
		Возврат рПроверки;
	КонецЕсли;	
	
	МассивСсылок 	= Новый Массив;
	Ссылки		 	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Ссылки");
	Если ЗначениеЗаполнено(Ссылки) Тогда
		Если ТипЗнч(Ссылки) = Тип("Массив") Тогда
			МассивСсылок = Ссылки;
		Иначе
			МассивСсылок = Новый Массив;
			МассивСсылок.Добавить(Ссылки);			
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Задания.Документ 					КАК Документ,
	|	Задания.СостоянияНакладной_Нов		КАК НовоеСостояние,
	|	Задания.Отгружен_Нов				КАК НовыйОтгружен,
	|	ПланНабора.Ссылка 					КАК ПланНабора,
	|	Задания.Документ.Проведен 			КАК НакладнаяПроведена,
	|	Задания.Документ.СостояниеНакладной КАК СтароеСостояние
	|ИЗ
	|	РегистрСведений.ЗаданиеНаСменуСтатусовНакладной КАК Задания
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	Документ.ПланНабора КАК ПланНабора
	|ПО 
	|	Задания.Документ = ПланНабора.Накладная
	|	И ПланНабора.Проведен = Истина
	|ГДЕ
	|	Задания.ДатаЗаписи >= &ДатаЗаписи
	|	И НЕ Задания.Отработано
	|	И НЕ Задания.Пропущено
	|	И НЕ Задания.Ошибка
	|	" + ?(МассивСсылок.Количество() > 0, "И Задания.Документ В (&МассивСсылок)", "") + "
	|УПОРЯДОЧИТЬ ПО
	|	Задания.ДатаЗаписи,
	|	Задания.Документ
	|";
	
	Запрос.УстановитьПараметр("ДатаЗаписи", 	ОбщегоНазначения_ПИ.ПолучитьЗначениеКонстанты("ДатаЗапретаРедактирования"));    
	Запрос.УстановитьПараметр("МассивСсылок",	МассивСсылок);    
	
	МассивОшибок = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаписатьВЛог("ЗаменаСтатусовНакладных", "К обработке: " +Выборка.Количество() + " накладных.", "Информация");
	
	Пока Выборка.Следующий() цикл 
		НужноЗаписыватьДокумент=Истина;
		
		Накладная	   	=   Выборка.Документ;  
		НовоеСостояние	=	Выборка.НовоеСостояние;	
		СтароеСостояние	=   Выборка.СтароеСостояние;	
		
		Если СтароеСостояние = НовоеСостояние 
			ИЛИ СтароеСостояние = Перечисления.СостоянияНакладной.Отгружена 
			ИЛИ НЕ Выборка.НакладнаяПроведена ТОГДА
			
			НужноЗаписыватьДокумент = Ложь;
		КонецЕсли;		
		
		Если НужноЗаписыватьДокумент Тогда
			рОбработки = ОбработатьНакладную(Накладная, НовоеСостояние, Выборка.ПланНабора);
			Если рОбработки.Успешно Тогда
				рОбработки.ОбработаноОбъектов = 1;
			Иначе                      
				ТекстСообщения = СтрШаблон("Ошибка изменения статуса накладной: %1. Ошибка установки статуса: %2. %3.", 
					Накладная, НовоеСостояние, СтрСоединить(рОбработки.Ошибки, Символы.ПС));
				ЗаписатьВЛог("ЗаменаСтатусовНакладных", ТекстСообщения, "Ошибка");
			КонецЕсли;			
		Иначе
			рОбработки = МаркировкаКС.СтруктураРезультата();		                       
			
			ТекстСообщения = СтрШаблон("Текущее состояние накладной: %1 - %2. Накладная пропущена.", Накладная, СтароеСостояние);
			рОбработки.Сообщения.Добавить(ТекстСообщения);
		КонецЕсли;
		
		рОбработки.Данные = Накладная;
		
		МаркировкаКС.ВывестиОшибки(рОбработки);
		МаркировкаКС.ВывестиСообщения(рОбработки);				
		
		ЗаписатьРезультатыОбработки(рОбработки);
		
		Если рОбработки.Успешно Тогда
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов	+ 1;	
		КонецЕсли;
	КонецЦикла;	
	
	ЗаписатьВЛог("ЗаменаСтатусовНакладных", "Обработано: " + Результат.ОбработаноОбъектов + " накладных.", "Информация");
	
	Возврат Результат;
КонецФункции

Функция РасчитатьДанныеПаллет(Накладная)
	СтруктураВозврата = Новый Структура("КоличествоПаллет,ОбъемПаллет,Паллетировщик,НачалоПаллетирования,ОкончаниеПаллетирования",
		0, 0, Справочники.ФизическиеЛица.ПустаяСсылка(), ТекущаяДата(), ПустаяДата()
	);
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("ДокОснование",Накладная);
	Запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	Запрос.УстановитьПараметр("Дата1",ОбщегоНазначения_ПИ.ПолучитьЗначениеКонстанты("ДатаЗапретаРедактирования")-30*24*3600);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка) 		КАК КоличествоПаллет,
	|	СУММА(Объем) 						КАК ОбъемПаллет,
	|	МАКСИМУМ(Паллетировщик)				КАК Паллетировщик,
	|	МИНИМУМ(НачалоПаллетирования) 		КАК НачалоПаллетирования,
	|	МАКСИМУМ(ОкончаниеПаллетирования) 	КАК ОкончаниеПаллетирования,
	|	МИНИМУМ(Дата) 						КАК МинимумДаты,
	|	МАКСИМУМ(Дата) 						КАК МаксимумДаты
	|ИЗ
	|	Документ.Паллета
	|ГДЕ
	|	Проведен
	|	И РеальноеПаллетирование
	|	И ДокОснование = &ДокОснование
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл		
		Если Выборка.ОбъемПаллет = null Тогда Продолжить КонецЕсли;
		
		СтруктураВозврата.КоличествоПаллет	= СтруктураВозврата.КоличествоПаллет	+ Выборка.КоличествоПаллет;
		СтруктураВозврата.ОбъемПаллет		= СтруктураВозврата.ОбъемПаллет			+ Выборка.ОбъемПаллет;        
		
		Если НЕ ЗначениеЗаполнено(СтруктураВозврата.Паллетировщик) и ЗначениеЗаполнено(Выборка.Паллетировщик) тогда
			СтруктураВозврата.Паллетировщик = Выборка.Паллетировщик;     
		КонецЕсли;         
		
		Если Выборка.НачалоПаллетирования <> ПустаяДата() тогда
			СтруктураВозврата.НачалоПаллетирования = Мин(Выборка.НачалоПаллетирования, СтруктураВозврата.НачалоПаллетирования);
		иначе
			СтруктураВозврата.НачалоПаллетирования = Мин(Выборка.МинимумДаты, СтруктураВозврата.НачалоПаллетирования);
		КонецЕсли;     
		
		Если Выборка.ОкончаниеПаллетирования<>ПустаяДата() Тогда
			СтруктураВозврата.ОкончаниеПаллетирования = Макс(Выборка.ОкончаниеПаллетирования,СтруктураВозврата.ОкончаниеПаллетирования);  
		Иначе
			СтруктураВозврата.ОкончаниеПаллетирования = Макс(Выборка.МаксимумДаты,СтруктураВозврата.ОкончаниеПаллетирования);  
		КонецЕсли;
	КонецЦикла;
	
	КоличествоСборныхПаллет = 0;
	ОбъемСборныхПаллет		= 0;
	Запрос.Текст			= "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка 					КАК Паллета,
	|	Паллетировщик 			КАК Паллетировщик,
	|	НачалоПаллетирования 	КАК НачалоПаллетирования,
	|	ОкончаниеПаллетирования КАК ОкончаниеПаллетирования,
	|	Дата 					КАК Дата
	|ИЗ
	|	Документ.Паллета КАК Паллета
	|ГДЕ
	|	Проведен
	|	И НЕ РеальноеПаллетирование
	|	И ОкончаниеПаллетирования <> &ПустаяДата
	|	И ЛистыНабора.Документ = &ДокОснование
	|	И Дата >= &Дата1
	|";	
	
	Выборка=запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Отбор = Новый Структура("Документ", Накладная);
		МассСтрок = Выборка.Паллета.ЛистыНабора.НайтиСтроки(Отбор);
		
		Кусок	  = Окр(МассСтрок.Количество()/Выборка.Паллета.ЛистыНабора.Количество(), 4);
		
		ОбъемСборныхПаллет		= ОбъемСборныхПаллет 		+ Выборка.Паллета.Объем*Кусок;
		КоличествоСборныхПаллет	= КоличествоСборныхПаллет	+ Кусок;
		
		Если не ЗначениеЗаполнено(СтруктураВозврата.Паллетировщик) и ЗначениеЗаполнено(Выборка.Паллетировщик) тогда
			СтруктураВозврата.Паллетировщик = Выборка.Паллетировщик;     
		КонецЕсли;         
		
		Если Выборка.НачалоПаллетирования<>ПустаяДата() тогда
			СтруктураВозврата.НачалоПаллетирования = Мин(Выборка.НачалоПаллетирования,СтруктураВозврата.НачалоПаллетирования);
		Иначе
			СтруктураВозврата.НачалоПаллетирования = Мин(Выборка.Дата,СтруктураВозврата.НачалоПаллетирования);
		КонецЕсли;     
		
		Если Выборка.ОкончаниеПаллетирования<>ПустаяДата() тогда
			СтруктураВозврата.ОкончаниеПаллетирования = Макс(Выборка.ОкончаниеПаллетирования,СтруктураВозврата.ОкончаниеПаллетирования);  
		Иначе
			СтруктураВозврата.ОкончаниеПаллетирования = Макс(Выборка.Дата,СтруктураВозврата.ОкончаниеПаллетирования);  
		КонецЕсли;		
	КонецЦикла;           
	
	СтруктураВозврата.КоличествоПаллет	= СтруктураВозврата.КоличествоПаллет	+ КоличествоСборныхПаллет;
	СтруктураВозврата.ОбъемПаллет		= СтруктураВозврата.ОбъемПаллет			+ ОбъемСборныхПаллет;
	
	Возврат СтруктураВозврата;
КонецФункции //РасчитатьДанныеПаллет(Накладная)

Процедура ЗаписатьРезультатыОбработки(рОбработки)	

	МЗ = РегистрыСведений.ЗаданиеНаСменуСтатусовНакладной.СоздатьМенеджерЗаписи();
		
	МЗ.Документ = рОбработки.Данные;
	МЗ.Прочитать();                
	Если ЗначениеЗаполнено(МЗ.Документ) Тогда
		МЗ.Пропущено	= Ложь;
		МЗ.Ошибка		= Ложь;
		
		Если рОбработки.Успешно Тогда
			Если рОбработки.ОбработаноОбъектов = 0 Тогда
				МЗ.Пропущено = Истина;
				МЗ.ТекстОшибки = СтрСоединить(рОбработки.Ошибки, Символы.ПС);
			Иначе
				МЗ.Пропущено	= Ложь;
				МЗ.Отработано	= Истина;
				МЗ.ТекстОшибки	= "";
			КонецЕсли;
		Иначе
			МЗ.Ошибка 		= Истина;
			МЗ.ТекстОшибки	= СтрСоединить(рОбработки.Ошибки, Символы.ПС);
			
			ЗаписатьВЛог("ИзменениеСатусаНакладной", "Ошибка изменения статуса: " + МЗ.Документ + " " + МЗ.ТекстОшибки, "Ошибка");
		КонецЕсли;
		
		МЗ.АвторОбработки	= ПараметрыСеанса.Пользователь;
		МЗ.ДатаОбработки	= ТекущаяДата();
		
		МЗ.Записать();
	Иначе
		ЗаписатьВЛог("Ошибки", "Не найдена запись задания на изменени накладной: " + рОбработки.Данные, "Ошибка");
	КонецЕсли;

КонецПроцедуры


#КонецОбласти


#Область ИзменениеДокументов

Функция ОбработатьНакладную(Накладная, НовоеСостояние, ПланНабора)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ДанныеПоПаллетам = Неопределено;	
	Если НовоеСостояние = Перечисления.СостоянияНакладной.ГотоваКОтгрузке тогда
		ДанныеПоПаллетам =	РасчитатьДанныеПаллет(Накладная);
	КонецЕсли;	 
	
	///////////////////////План набора	
	Если ЗначениеЗаполнено(ПланНабора) тогда 
		рИзменения = Изменить_ПланНабора(ПланНабора, НовоеСостояние, ДанныеПоПаллетам);
		Если НЕ рИзменения.Успешно тогда 
			МаркировкаКС.ДобавитьОшибки(Результат, рИзменения);
		КонецЕсли;				
		МаркировкаКС.ДобавитьСообщения(Результат, рИзменения);
	КонецЕсли;
	
	///////////////////////Задание набора
	Если Результат.Ошибки.Количество() = 0 Тогда
		рИзменения = Изменить_ЗаданияНабора(Накладная, НовоеСостояние);
		Если НЕ рИзменения.Успешно тогда
			МаркировкаКС.ДобавитьОшибки(Результат, рИзменения);
		КонецЕсли;	
		МаркировкаКС.ДобавитьСообщения(Результат, рИзменения);
	КонецЕсли;	
	
	///////////////////////Накладная. Писать предпоследним куском (после него только РС ЗаданиеНаСменуСтатусовНакладной)	
	Если Результат.Ошибки.Количество() = 0 Тогда
		рИзменения = Измененить_Накладная(Накладная, НовоеСостояние, ДанныеПоПаллетам);     
		Если НЕ рИзменения.Успешно тогда
			МаркировкаКС.ДобавитьОшибки(Результат, рИзменения);
		КонецЕсли;		
		МаркировкаКС.ДобавитьСообщения(Результат, рИзменения);
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;	
КонецФункции //ОбработатьНакладную(Накладная)

функция Изменить_ПланНабора(Знач ПланНабора, Знач НовоеСостояние, ДанныеПоПаллетам)  
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ПланНабораОбъект = ПланНабора.ПолучитьОбъект();		
	Для Каждого СтрТБ из ПланНабораОбъект.тБрэндов цикл
		СтрТБ.ОкончаниеПаллетирования	= ТекущаяДата();
		СтрТБ.Состояние					= НовоеСостояние;             
		Если ДанныеПоПаллетам <> Неопределено тогда  
			ЗаполнитьЗначенияСвойств(СтрТБ, ДанныеПоПаллетам);
		КонецЕсли;
	КонецЦикла;		
	
	Попытка
		ПланНабораОбъект.ЗаписатьБезОбработки(РежимЗаписиДокумента.Запись);
		Результат.Сообщения.Добавить("Обновлен план набора: " + ПланНабораОбъект);
	Исключение                                                            
		ТекстОшибки = СтрШаблон("Не удалось записать ПН %1. ", ПланНабора, ОписаниеОшибки());
		Результат.Ошибки.Добавить(ТекстОшибки);   
	КонецПопытки;	
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции

Функция Изменить_ЗаданияНабора(Знач Накладная, Знач СостояниеНакладной)
	Результат = МаркировкаКС.СтруктураРезультата(); 
	
	Запрос = Новый запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Документ.ЗаданиеНабора КАК ЗаданиеНабора
	|ГДЕ
	|	Накладная = &Накладная
	|	И Проведен
	|	И СостояниеНакладной <> &СостояниеНакладной
	|";
	
	Запрос.УстановитьПараметр("Накладная",Накладная);
	Запрос.УстановитьПараметр("СостояниеНакладной",СостояниеНакладной);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗНБ = Выборка.Ссылка.ПолучитьОбъект();
		ЗНБ.СостояниеНакладной = СостояниеНакладной;
		ЗНБ.ОбменДанными.Загрузка = Истина; 
		Попытка	
			ЗНБ.Записать();   
			Результат.Сообщения.Добавить("Обновлено ЗНБ: " + ЗНБ);
		Исключение     
			ТекстОшибки = СтрШаблон("Не удалось записать ЗНБ: %1, накладная: %2, по причине '%3'.", ЗНБ, Накладная, ОписаниеОшибки());
			Результат.Ошибки.Добавить(ТекстОшибки);
		КонецПопытки;
	КонецЦикла;   
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;	
КонецФункции //Изменить_ЗаданияНабора(Знач Накладная, Знач СостояниеНакладной)

Функция Измененить_Накладная(Знач Накладная, Знач СостояниеНакладной, ДанныеПоПаллетам)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ТЗНеизменяемыхРеквизитов = Новый ТаблицаЗначений;
	ТЗНеизменяемыхРеквизитов.Колонки.Добавить("ИмяРеквизита");
	
	СтрТЗ = ТЗНеизменяемыхРеквизитов.Добавить(); СтрТЗ.ИмяРеквизита = "КоличествоКоробок";	
	СтрТЗ = ТЗНеизменяемыхРеквизитов.Добавить(); СтрТЗ.ИмяРеквизита = "Трудозатраты";
	// Кухарь А.Ю.  11.03.2026 начало
	СтрТЗ = ТЗНеизменяемыхРеквизитов.Добавить(); СтрТЗ.ИмяРеквизита = "ЗаписьНЕВПопытке";   	
	// Кухарь А.Ю.  11.03.2026 конец

	
	НакладнаяОбъект = Накладная.ПолучитьОбъект();     
	Если ДанныеПоПаллетам <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НакладнаяОбъект, ДанныеПоПаллетам); 
	КонецЕсли;
	
	НакладнаяОбъект.СостояниеНакладной = СостояниеНакладной;
	Попытка    
		НакладнаяОбъект.ЗаписьБезКонтроляПолномочий(ТЗНеизменяемыхРеквизитов);	
		Результат.Сообщения.Добавить("Обновлена накл.: " + НакладнаяОбъект);		
	Исключение   
		ТекстСообщения = СтрШаблон("Не удалось записать накладную: %1, по причине: %2.", Накладная, ОписаниеОшибки());		
		Результат.Ошибки.Добавить(ТекстСообщения);
	КонецПопытки;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //Измененить_Накладная(Знач Накладная, Знач СостояниеНакладной, ДанныеПоПаллетам)

#КонецОбласти
